telespial/EdgeAI_Video_Soot_Detector_demo_STM32H7S78-DK/firmware/STM32H7S78-DK-USB-Demo-Source/Drivers/BSP/Components/gt911/gt911_reg.h
/**
  ******************************************************************************
  * @file    gt911_reg.h
  * @author  MCD Application Team
  * @brief   Header of gt911_reg.c
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef GT911_REG_H
#define GT911_REG_H

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#define GT911_REG_OK                      (0)
#define GT911_REG_ERROR                   (-1)

/* Includes ------------------------------------------------------------------*/
/* Macros --------------------------------------------------------------------*/

/** @addtogroup BSP
  * @{
  */

/** @addtogroup Component
  * @{
  */

/** @addtogroup GT911
  * @{
  */

/* Exported types ------------------------------------------------------------*/

/** @defgroup GT911_Exported_Types GT911 Exported Types
  * @{
  */
/************** Generic Function  *******************/

typedef int32_t (*GT911_Write_Func)(void *, uint16_t, uint8_t *, uint16_t);
typedef int32_t (*GT911_Read_Func)(void *, uint16_t, uint8_t *, uint16_t);

/**
  * @}
  */

/** @defgroup GT911_Imported_Globals GT911 Imported Globals
  * @{
  */
typedef struct
{
  GT911_Write_Func   WriteReg;
  GT911_Read_Func    ReadReg;
  void                *handle;
} gt911_ctx_t;
/**
  * @}
  */

/** @defgroup GT911_Exported_Constants GT911 Exported Constants
  * @{
  */

/* Current mode register of the GT911 (R/W) */
#define GT911_DEV_MODE_REG         0x00U

/* Gesture ID register */
#define GT911_GEST_ID_REG          0x814BU

/* Gesture mode enabled */
#define GT911_GESTURE_EN           0x8U

/* Gesture Coordinates registers */
#define GT911_START_X_L            0x814DU
#define GT911_START_X_H            0x814EU
#define GT911_START_Y_L            0x814FU
#define GT911_START_Y_H            0x8150U
#define GT911_END_X_L              0x8151U
#define GT911_END_X_H              0x8152U
#define GT911_END_Y_L              0x8153U
#define GT911_END_Y_H              0x8154U
#define GT911_WEIGHT_L             0x8155U
#define GT911_WEIGHT_H             0x8156U
#define GT911_HEIGHT_L             0x8157U
#define GT911_HEIGHT_H             0x8158U


/* Touch Data Status register : gives number of active touch points (0..5) */
#define GT911_TD_STAT_REG          0x814EU

/* P1 X, Y coordinates, weight(Point size) and track-id registers */
#define GT911_P1_XL_REG            0x8150U
#define GT911_P1_XH_REG            0x8151U
#define GT911_P1_YL_REG            0x8152U
#define GT911_P1_YH_REG            0x8153U
#define GT911_P1_WEIGHTL_REG       0x8154U
#define GT911_P1_WEIGHTH_REG       0x8155U
#define GT911_P1_TID_REG           0x8157U

/* P2 X, Y coordinates, weight and tid registers */
#define GT911_P2_XL_REG            0x8158U
#define GT911_P2_XH_REG            0x8159U
#define GT911_P2_YL_REG            0x815AU
#define GT911_P2_YH_REG            0x815BU
#define GT911_P2_WEIGHTL_REG       0x815CU
#define GT911_P2_WEIGHTH_REG       0x815DU
#define GT911_P2_TID_REG           0x815FU

/* P3 X, Y coordinates, weight and tid registers */
#define GT911_P3_XL_REG            0x8160U
#define GT911_P3_XH_REG            0x8161U
#define GT911_P3_YL_REG            0x8162U
#define GT911_P3_YH_REG            0x8163U
#define GT911_P3_WEIGHTL_REG       0x8164U
#define GT911_P3_WEIGHTH_REG       0x8165U
#define GT911_P3_TID_REG           0x8167U

/* P4 X, Y coordinates, weight and tid registers */
#define GT911_P4_XL_REG            0x8168U
#define GT911_P4_XH_REG            0x8169U
#define GT911_P4_YL_REG            0x816AU
#define GT911_P4_YH_REG            0x816BU
#define GT911_P4_WEIGHTL_REG       0x816CU
#define GT911_P4_WEIGHTH_REG       0x816DU
#define GT911_P4_TID_REG           0x816FU

/* P5 X, Y coordinates, weight and tid registers */
#define GT911_P5_XL_REG            0x8170U
#define GT911_P5_XH_REG            0x8171U
#define GT911_P5_YL_REG            0x8172U
#define GT911_P5_YH_REG            0x8173U
#define GT911_P5_WEIGHTL_REG       0x8174U
#define GT911_P5_WEIGHTH_REG       0x8175U
#define GT911_P5_TID_REG           0x8177U

/* Threshold for touch detection */
#define GT911_TH_GROUP_REG         0x80U

/* Filter function coefficients */
#define GT911_TH_DIFF_REG          0x85U

/* Control register */
#define GT911_CTRL_REG             0x86U

/* The time period of switching from Active mode to Monitor mode when there is no touching */
#define GT911_TIMEENTERMONITOR_REG 0x87U

/* Report rate in Active mode */
#define GT911_PERIODACTIVE_REG     0x88U

/* Report rate in Monitor mode */
#define GT911_PERIODMONITOR_REG    0x89U

/* Maximum offset while Moving Left and Moving Right gesture */
#define GT911_OFFSET_LR_REG        0x92U

/* Maximum offset while Moving Up and Moving Down gesture */
#define GT911_OFFSET_UD_REG        0x93U

/* Minimum distance while moving gesture */
#define GT911_DIS_GESTURE_REG      0x8071U

/* High 8-bit of LIB Version info */
#define GT911_LIB_VER_H_REG        0xA1U

/* Low 8-bit of LIB Version info */
#define GT911_LIB_VER_L_REG        0xA2U

/* Chip Selecting */
#define GT911_CIPHER_REG           0xA3U

/* Module_Switch1 register for Interrupt */
#define GT911_MSW1_REG             0x804DU

/* Current power mode the GT911 system is in (R) */
#define GT911_PWR_MODE_REG         0xA5U

/* GT911 firmware version */
#define GT911_FIRMID_REG           0x8144U

/* GT911 Chip identification register */
#define GT911_CHIP_ID_REG          0x8140U

/* Release code version */
#define GT911_RELEASE_CODE_ID_REG  0xAFU

/* Current operating mode the GT911 system is in (R) */
#define GT911_COMMAND_REG          0x8040U

/* Coordinates report rate (= 5+N ms) */
#define GT911_REFRESH_RATE_REG     0x8056U
#define GT911_REFRESH_RATE_MSK     0x0FU

/* Version number configuration */
#define GT911_CONFIG_VERS_REG      0x8047U

