telespial/EdgeAI_Video_Soot_Detector_demo_STM32H7S78-DK/firmware/STM32H7S78-DK-USB-Demo-Source/Drivers/BSP/Components/gt911/gt911_reg.h
/*******************************************************************************
  * Register      : P2_XH
  * Address       : 0X09
  * Bit Group Name: Second Event Flag
  * Permission    : R
  * Default value : 0xF0U
  *******************************************************************************/
#define   GT911_P2_XH_EF_BIT_MASK        0xC0U
#define   GT911_P2_XH_EF_BIT_POSITION    6U
int32_t gt911_p2_xh_ef(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P2_XH
  * Address       : 0X09
  * Bit Group Name: Second Touch X Position
  * Permission    : R
  * Default value : 0x0FU
  *******************************************************************************/
#define   GT911_P2_XH_TP_BIT_MASK        0x0FU
#define   GT911_P2_XH_TP_BIT_POSITION    8U
int32_t gt911_p2_xh_tp(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P2_XL
  * Address       : 0X0A
  * Bit Group Name: Second Touch X Position
  * Permission    : R
  * Default value : 0xFFU
  *******************************************************************************/
#define   GT911_P2_XL_TP_BIT_MASK        0xFFU
#define   GT911_P2_XL_TP_BIT_POSITION    9U
int32_t gt911_p2_xl_tp(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P2_YH
  * Address       : 0X0B
  * Bit Group Name: Second Touch ID
  * Permission    : R
  * Default value : 0xF0U
  *******************************************************************************/
#define   GT911_P2_YH_TID_BIT_MASK        0xF0U
#define   GT911_P2_YH_TID_BIT_POSITION    15U
int32_t gt911_p2_yh_tid(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P2_YH
  * Address       : 0x0B
  * Bit Group Name: Second Touch Y Position
  * Permission    : R
  * Default value : 0x0FU
  *******************************************************************************/
#define   GT911_P2_YH_TP_BIT_MASK        0x0FU
#define   GT911_P2_YH_TP_BIT_POSITION    11U
int32_t gt911_p2_yh_tp(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P2_YL
  * Address       : 0X0C
  * Bit Group Name: Second Touch Y Position
  * Permission    : R
  * Default value : 0xFFU
  *******************************************************************************/
#define   GT911_P2_YL_TP_BIT_MASK        0xFFU
#define   GT911_P2_YL_TP_BIT_POSITION    10U
int32_t gt911_p2_yl_tp(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P2_WEIGHT
  * Address       : 0X0D
  * Bit Group Name: Second Touch Weight(pressure)
  * Permission    : R
  * Default value : 0xFFU
  *******************************************************************************/
#define   GT911_P2_WEIGHT_BIT_MASK        0xFFFU
#define   GT911_P2_WEIGHT_BIT_POSITION    12U
int32_t gt911_p2_weight(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P2_TID
  * Address       : 0X0E
  * Bit Group Name: Second Touch Area
  * Permission    : R
  * Default value : 0xFFU
  *******************************************************************************/
#define   GT911_P2_TID_BIT_MASK        0xFFU
#define   GT911_P2_TID_BIT_POSITION    15U
int32_t gt911_p2_tid(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P3_XH
  * Address       : 0X0F
  * Bit Group Name: Third Event Flag
  * Permission    : R
  * Default value : 0xF0U
  *******************************************************************************/
#define   GT911_P3_XH_EF_BIT_MASK        0xC0U
#define   GT911_P3_XH_EF_BIT_POSITION    16U
int32_t gt911_p3_xh_ef(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P3_XH
  * Address       : 0X0F
  * Bit Group Name: Third Touch X High Position
  * Permission    : R
  * Default value : 0x0FU
  *******************************************************************************/
#define   GT911_P3_XH_TP_BIT_MASK        0x0FU
#define   GT911_P3_XH_TP_BIT_POSITION    17U
int32_t gt911_p3_xh_tp(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P3_XL
  * Address       : 0X10
  * Bit Group Name: Third Touch X Low Position
  * Permission    : R
  * Default value : 0xFFU
  *******************************************************************************/
#define   GT911_P3_XL_TP_BIT_MASK        0xFFU
#define   GT911_P3_XL_TP_BIT_POSITION    16U
int32_t gt911_p3_xl_tp(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P3_YH
  * Address       : 0X11
  * Bit Group Name: Third Touch ID
  * Permission    : R
  * Default value : 0xF0U
  *******************************************************************************/
#define   GT911_P3_YH_TID_BIT_MASK        0xF0U
#define   GT911_P3_YH_TID_BIT_POSITION    23U
int32_t gt911_p3_yh_tid(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P3_YH
  * Address       : 0x11
  * Bit Group Name: Third Touch Y High Position
  * Permission    : R
  * Default value : 0x0FU
  *******************************************************************************/
#define   GT911_P3_YH_TP_BIT_MASK        0x0FU
#define   GT911_P3_YH_TP_BIT_POSITION    18U
int32_t gt911_p3_yh_tp(gt911_ctx_t *pCtx, uint8_t *pValue);

