telespial/EdgeAI_Video_Soot_Detector_demo_STM32H7S78-DK/firmware/STM32H7S78-DK-USB-Demo-Source/Drivers/BSP/Components/gt911/gt911_reg.h
/*******************************************************************************
  * Register      : P3_YL
  * Address       : 0X12
  * Bit Group Name: Third Touch Y Low Position
  * Permission    : R
  * Default value : 0xFFU
  *******************************************************************************/
#define   GT911_P3_YL_TP_BIT_MASK        0xFFU
#define   GT911_P3_YL_TP_BIT_POSITION    17U
int32_t gt911_p3_yl_tp(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P3_WEIGHT
  * Address       : 0X13
  * Bit Group Name: Third Touch Weight(pressure)
  * Permission    : R
  * Default value : 0xFFU
  *******************************************************************************/
#define   GT911_P3_WEIGHT_BIT_MASK        0xFFFU
#define   GT911_P3_WEIGHT_BIT_POSITION    19U
int32_t gt911_p3_weight(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P3_TID
  * Address       : 0X14
  * Bit Group Name: Third Touch Area
  * Permission    : R
  * Default value : 0xFFU
  *******************************************************************************/
#define   GT911_P3_TID_BIT_MASK        0xFFU
#define   GT911_P3_TID_BIT_POSITION    23U
int32_t gt911_p3_tid(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P4_XH
  * Address       : 0X15
  * Bit Group Name: Fourth Event Flag
  * Permission    : R
  * Default value : 0xF0U
  *******************************************************************************/
#define   GT911_P4_XH_EF_BIT_MASK        0xC0U
#define   GT911_P4_XH_EF_BIT_POSITION    25
int32_t gt911_p4_xh_ef(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P4_XH
  * Address       : 0X15
  * Bit Group Name: Fourth Touch X High Position
  * Permission    : R
  * Default value : 0x0FU
  *******************************************************************************/
#define   GT911_P4_XH_TP_BIT_MASK        0x0FU
#define   GT911_P4_XH_TP_BIT_POSITION    25U
int32_t gt911_p4_xh_tp(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P4_XL
  * Address       : 0X16
  * Bit Group Name: Fourth Touch X Low Position
  * Permission    : R
  * Default value : 0xFFU
  *******************************************************************************/
#define   GT911_P4_XL_TP_BIT_MASK        0xFFU
#define   GT911_P4_XL_TP_BIT_POSITION    24U
int32_t gt911_p4_xl_tp(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P4_YH
  * Address       : 0X17
  * Bit Group Name: Fourth Touch ID
  * Permission    : R
  * Default value : 0xF0U
  *******************************************************************************/
#define   GT911_P4_YH_TID_BIT_MASK        0xF0U
#define   GT911_P4_YH_TID_BIT_POSITION    31U
int32_t gt911_p4_yh_tid(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P4_YH
  * Address       : 0x17
  * Bit Group Name: Fourth Touch Y High Position
  * Permission    : R
  * Default value : 0x0FU
  *******************************************************************************/
#define   GT911_P4_YH_TP_BIT_MASK        0x0FU
#define   GT911_P4_YH_TP_BIT_POSITION    27U
int32_t gt911_p4_yh_tp(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P4_YL
  * Address       : 0X18
  * Bit Group Name: Fourth Touch Y Low Position
  * Permission    : R
  * Default value : 0xFFU
  *******************************************************************************/
#define   GT911_P4_YL_TP_BIT_MASK        0xFFU
#define   GT911_P4_YL_TP_BIT_POSITION    26U
int32_t gt911_p4_yl_tp(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P4_WEIGHT
  * Address       : 0X19
  * Bit Group Name: Fourth Touch Weight(pressure)
  * Permission    : R
  * Default value : 0xFFU
  *******************************************************************************/
#define   GT911_P4_WEIGHT_BIT_MASK        0xFFFU
#define   GT911_P4_WEIGHT_BIT_POSITION    28U
int32_t gt911_p4_weight(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P4_TID
  * Address       : 0X1A
  * Bit Group Name: Fourth Touch Area
  * Permission    : R
  * Default value : 0xFFU
  *******************************************************************************/
#define   GT911_P4_TID_BIT_MASK        0xFFU
#define   GT911_P4_TID_BIT_POSITION    31U
int32_t gt911_p4_tid(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P5_XH
  * Address       : 0X1B
  * Bit Group Name: Fifth Event Flag
  * Permission    : R
  * Default value : 0xF0U
  *******************************************************************************/
#define   GT911_P5_XH_EF_BIT_MASK        0xC0U
#define   GT911_P5_XH_EF_BIT_POSITION    6U
int32_t gt911_p5_xh_ef(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P5_XH
  * Address       : 0X1B
  * Bit Group Name: Fifth Touch X High Position
  * Permission    : R
  * Default value : 0x0FU
  *******************************************************************************/
#define   GT911_P5_XH_TP_BIT_MASK        0x0FU
#define   GT911_P5_XH_TP_BIT_POSITION    0U
int32_t gt911_p5_xh_tp(gt911_ctx_t *pCtx, uint8_t *pValue);

