telespial/EdgeAI_Video_Soot_Detector_demo_STM32H7S78-DK/firmware/STM32H7S78-DK-USB-Demo-Source/Drivers/BSP/Components/gt911/gt911_reg.h
/*******************************************************************************
  * Register      : P5_XL
  * Address       : 0X1C
  * Bit Group Name: Fifth Touch X Low Position
  * Permission    : R
  * Default value : 0xFFU
  *******************************************************************************/
#define   GT911_P5_XL_TP_BIT_MASK        0xFFU
#define   GT911_P5_XL_TP_BIT_POSITION    0U
int32_t gt911_p5_xl_tp(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P5_YH
  * Address       : 0X1D
  * Bit Group Name: Fifth Touch ID
  * Permission    : R
  * Default value : 0xF0U
  *******************************************************************************/
#define   GT911_P5_YH_TID_BIT_MASK        0xF0U
#define   GT911_P5_YH_TID_BIT_POSITION    4U
int32_t gt911_p5_yh_tid(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P5_YH
  * Address       : 0x1D
  * Bit Group Name: Fifth Touch Y High Position
  * Permission    : R
  * Default value : 0x0FU
  *******************************************************************************/
#define   GT911_P5_YH_TP_BIT_MASK        0x0FU
#define   GT911_P5_YH_TP_BIT_POSITION    0U
int32_t gt911_p5_yh_tp(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P5_YL
  * Address       : 0X1E
  * Bit Group Name: Fifth Touch Y Low Position
  * Permission    : R
  * Default value : 0xFFU
  *******************************************************************************/
#define   GT911_P5_YL_TP_BIT_MASK        0xFFU
#define   GT911_P5_YL_TP_BIT_POSITION    0U
int32_t gt911_p5_yl_tp(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P5_WEIGHT
  * Address       : 0X1F
  * Bit Group Name: Fifth Touch Weight(pressure)
  * Permission    : R
  * Default value : 0xFFU
  *******************************************************************************/
#define   GT911_P5_WEIGHT_BIT_MASK        0xFFFU
#define   GT911_P5_WEIGHT_BIT_POSITION    0U
int32_t gt911_p5_weight(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : P5_TID
  * Address       : 0X20
  * Bit Group Name: Fifth Touch Area
  * Permission    : R
  * Default value : 0xFFU
  *******************************************************************************/
#define   GT911_P5_TID_BIT_MASK        0xFFU
#define   GT911_P5_TID_BIT_POSITION    4U
int32_t gt911_p5_tid(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : TH_GROUP
  * Address       : 0X80
  * Bit Group Name: Threshold for touch detection
  * Permission    : RW
  * Default value : None
  *******************************************************************************/
#define   GT911_TH_GROUP_BIT_MASK        0xFFU
#define   GT911_TH_GROUP_BIT_POSITION    0U
int32_t gt911_th_group(gt911_ctx_t *pCtx, uint8_t value);

/*******************************************************************************
  * Register      : TH_DIFF
  * Address       : 0X85
  * Bit Group Name: Filter function coefficient
  * Permission    : RW
  * Default value : None
  *******************************************************************************/
#define   GT911_TH_DIFF_BIT_MASK        0xFFU
#define   GT911_TH_DIFF_BIT_POSITION    0U
int32_t gt911_th_diff(gt911_ctx_t *pCtx, uint8_t value);

/*******************************************************************************
  * Register      : CTRL
  * Address       : 0X86
  * Bit Group Name:
  * Permission    : RW
  * Default value : 0x01
  *******************************************************************************/
#define   GT911_CTRL_BIT_MASK           0xFFU
#define   GT911_CTRL_BIT_POSITION       0U
int32_t gt911_ctrl(gt911_ctx_t *pCtx, uint8_t value);

/*******************************************************************************
  * Register      : TIMEENTERMONITOR
  * Address       : 0X87
  * Bit Group Name:
  * Permission    : RW
  * Default value : 0x0A
  *******************************************************************************/
#define   GT911_TIMEENTERMONITOR_BIT_MASK           0xFFU
#define   GT911_TIMEENTERMONITOR_BIT_POSITION       0U
int32_t gt911_time_enter_monitor(gt911_ctx_t *pCtx, uint8_t value);

/*******************************************************************************
  * Register      : PERIODACTIVE
  * Address       : 0X88
  * Bit Group Name:
  * Permission    : RW
  * Default value : None
  *******************************************************************************/
#define   GT911_PERIODACTIVE_BIT_MASK           0xFFU
#define   GT911_PERIODACTIVE_BIT_POSITION       0U
int32_t gt911_period_active(gt911_ctx_t *pCtx, uint8_t value);

/*******************************************************************************
  * Register      : PERIODMONITOR
  * Address       : 0X89
  * Bit Group Name:
  * Permission    : RW
  * Default value : 0x28
  *******************************************************************************/
#define   GT911_PERIODMONITOR_BIT_MASK           0xFFU
#define   GT911_PERIODMONITOR_BIT_POSITION       0U
int32_t gt911_period_monitor(gt911_ctx_t *pCtx, uint8_t value);

/*******************************************************************************
  * Register      : DISTANCE_LEFT_RIGHT
  * Address       : 0X94
  * Bit Group Name:
  * Permission    : RW
  * Default value : 0x19
  *******************************************************************************/
#define   GT911_DISTANCE_LR_BIT_MASK           0x0FU
#define   GT911_DISTANCE_LR_BIT_POSITION       0U
int32_t  gt911_distance_left_right(gt911_ctx_t *pCtx, uint8_t value);

